LAPORAN PRAKTIKUM 6/app/Controllers/BukuController.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $model = new BukuModel();
        $data['buku'] = $model->findAll();

SELECT *
FROM `buku`
WHERE `buku`.`id` = '1'
---
    public function edit($id)
    {
        $model = new BukuModel();
        $data['buku'] = $model->find($id);