LAPORAN PRAKTIKUM 6/app/Controllers/LoginController.php

SELECT *
FROM `user`
WHERE `email` = '2210817210032@mhs.ulm.ac.id'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        log_message('debug', 'Email: ' . $email);
        log_message('debug', 'Password: ' . $password);

        if (is_string($email) && is_string($password)) {
            $user = $model->where('email', $email)->first();